{
	"modelTopology": {
		"class_name": "Sequential",
		"config": {
			"name": "sequential_18000",
			"layers": [
				{
					"class_name": "Dense",
					"config": {
						"units": 35,
						"activation": "sigmoid",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": {
								"scale": 1,
								"mode": "fan_avg",
								"distribution": "normal",
								"seed": null
							}
						},
						"bias_initializer": {
							"class_name": "Zeros",
							"config": {}
						},
						"kernel_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"bias_constraint": null,
						"name": "dense_Dense35999",
						"trainable": true,
						"batch_input_shape": [null, 100],
						"dtype": "float32"
					}
				},
				{
					"class_name": "Dense",
					"config": {
						"units": 8,
						"activation": "softmax",
						"use_bias": true,
						"kernel_initializer": {
							"class_name": "VarianceScaling",
							"config": {
								"scale": 1,
								"mode": "fan_avg",
								"distribution": "normal",
								"seed": null
							}
						},
						"bias_initializer": {
							"class_name": "Zeros",
							"config": {}
						},
						"kernel_regularizer": null,
						"bias_regularizer": null,
						"activity_regularizer": null,
						"kernel_constraint": null,
						"bias_constraint": null,
						"name": "dense_Dense36000",
						"trainable": true
					}
				}
			]
		},
		"keras_version": "tfjs-layers 1.7.4",
		"backend": "tensor_flow.js"
	},
	"format": "layers-model",
	"generatedBy": "TensorFlow.js tfjs-layers v1.7.4",
	"convertedBy": null,
	"weightsManifest": [
		{
			"paths": ["./model_9174.weights.bin"],
			"weights": [
				{
					"name": "dense_Dense35999/kernel",
					"shape": [100, 35],
					"dtype": "float32"
				},
				{
					"name": "dense_Dense35999/bias",
					"shape": [35],
					"dtype": "float32"
				},
				{
					"name": "dense_Dense36000/kernel",
					"shape": [35, 8],
					"dtype": "float32"
				},
				{
					"name": "dense_Dense36000/bias",
					"shape": [8],
					"dtype": "float32"
				}
			]
		}
	]
}
