{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_17517","layers":[{"class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D35033","trainable":true,"batch_input_shape":[null,10,10,1],"dtype":"float32"}},{"class_name":"AveragePooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D17517","trainable":true}},{"class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2,2],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D35034","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten17517","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense52549","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense52550","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense52551","trainable":true}}]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null,"weightsManifest":[{"paths":["./model_cc_5k_lastgen.weights.bin"],"weights":[{"name":"conv2d_Conv2D35033/kernel","shape":[3,3,1,4],"dtype":"float32"},{"name":"conv2d_Conv2D35033/bias","shape":[4],"dtype":"float32"},{"name":"conv2d_Conv2D35034/kernel","shape":[2,2,4,4],"dtype":"float32"},{"name":"conv2d_Conv2D35034/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense52549/kernel","shape":[36,16],"dtype":"float32"},{"name":"dense_Dense52549/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense52550/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense52550/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense52551/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense52551/bias","shape":[4],"dtype":"float32"}]}]}